Model: "DockNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 360, 360, 1) 0                                            
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 360, 360, 64) 640         input[0][0]                      
__________________________________________________________________________________________________
act_1 (Activation)              (None, 360, 360, 64) 0           conv_1[0][0]                     
__________________________________________________________________________________________________
pool_1 (MaxPooling2D)           (None, 180, 180, 64) 0           act_1[0][0]                      
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 180, 180, 64) 36928       pool_1[0][0]                     
__________________________________________________________________________________________________
act_2 (Activation)              (None, 180, 180, 64) 0           conv_2[0][0]                     
__________________________________________________________________________________________________
pool_2 (MaxPooling2D)           (None, 90, 90, 64)   0           act_2[0][0]                      
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 90, 90, 32)   18464       pool_2[0][0]                     
__________________________________________________________________________________________________
act_3 (Activation)              (None, 90, 90, 32)   0           conv_3[0][0]                     
__________________________________________________________________________________________________
pool_3 (MaxPooling2D)           (None, 45, 45, 32)   0           act_3[0][0]                      
__________________________________________________________________________________________________
conv_4 (Conv2D)                 (None, 45, 45, 16)   4624        pool_3[0][0]                     
__________________________________________________________________________________________________
act_4 (Activation)              (None, 45, 45, 16)   0           conv_4[0][0]                     
__________________________________________________________________________________________________
pool_4 (MaxPooling2D)           (None, 22, 22, 16)   0           act_4[0][0]                      
__________________________________________________________________________________________________
pool_5 (MaxPooling2D)           (None, 11, 11, 16)   0           pool_4[0][0]                     
__________________________________________________________________________________________________
flatten (Flatten)               (None, 1936)         0           pool_5[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           123968      flatten[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        dense_1[0][0]                    
__________________________________________________________________________________________________
black_border (Dense)            (None, 1)            33          dense_2[0][0]                    
__________________________________________________________________________________________________
good (Dense)                    (None, 1)            33          dense_2[0][0]                    
__________________________________________________________________________________________________
gridline (Dense)                (None, 1)            33          dense_2[0][0]                    
__________________________________________________________________________________________________
shaded (Dense)                  (None, 1)            33          dense_2[0][0]                    
==================================================================================================
Total params: 186,836
Trainable params: 186,836
Non-trainable params: 0
__________________________________________________________________________________________________